Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsHookBend
Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsBarBend
Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarAngleOnBarOrHookBend
Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
Remarks:
Only applies to RebarConstraints with TargetRebarConstraintType BarBend or HookBend.
For HookBends, values can be 0, 1, 2, 3 or 4, representing angular locations of 0, 45, 90, 135,
and 180 degrees around the hook, starting at the 'base' of the hook (or end of the bar without hook).
For interior BarBends, values can 0 or 1, where 0 means at the intersection of the bar bend and the edge
specified by getTargetRebarEdgeNumber, and 1 means the mid-point of the bend arc.
Returns:
The angular increment relative to the reference bar edge.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is not 'HookBend' or 'BarBend'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarHookBarEnd
Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'HookBend.'
Remarks:
0 means start of the bar, and 1 indicates end of the bar.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is not 'HookBend'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarBendNumber
Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'BarBend.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is not 'BarBend'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarEdgeNumber
Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'Edge.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarConstraintType
Returns the TargetRebarConstraintType of the handle on the other Rebar Element
to which this RebarConstraint is attached. The RebarConstraintType of the
RebarConstraint must be 'ToOtherRebar.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceReference
Returns a reference to the host Element face to which the RebarConstraint is attached.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetRebarConstraintTargetHostFaceType
Returns the RebarConstraintTargetHostFaceType of the host Element face to which
the RebarConstraint is attached.  The RebarConstraintType of the RebarConstraint
must be 'FixedDistanceToHostFace' or 'ToCover.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement
Returns the Element object (either Host or Rebar) which provides the constraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint
A class representing a constraint on a handle of a rebar element.
Remarks:
Each handle on a rebar is defined by a plane, and can be constrained along the
direction perpendicular to the plane.  Rebar constraints work by locking the
handle planes to planar references, or 'targets.'  These targets can be:
planar surfaces of host elements, or the handle planes of stirrup bars (only applies to standard style bars).
For planar host element surfaces, a rebar handle can either be locked at a constant
distance, or, if the host surface has a specified cover, then the handle can be
joined directly to the cover of the surface.
Standard style bars can be locked to the handle planes of stirrup style rebar.
In the special case of a straight, standard style bar, running perpendicular
to the plane of the stirrup bar, the bar can constrain itself to distinct locations
along bends in stirrup bars - points located at 0 degrees, 45 degrees, 90 degrees,
etc. around each bend.  This is done by simultaneously locking both the straight
bar's edge handle and its planar position handle to one or both of the stirrup edges
adjacent to the bend in the stirrup.
Usually, to form a constraint, the handle plane and the reference plane must be parallel.
However, bar end handles can be constrained to planes at angles up to 60 degrees.
Arc-shaped rebar is a special case, and can form constraints to concentric host surfaces.
RebarConstraints can only be constructed internally by Revit.  They are
available to the API by querying a rebar element's RebarConstraintsManager.
Since:
2014